
const monographs = [
  [ "あ", "a" ],
  [ "い", "i" ],
  [ "う", "u" ],
  [ "え", "e" ],
  [ "お", "o" ],

  [ "か", "ka" ],
  [ "き", "ki" ],
  [ "く", "ku" ],
  [ "け", "ke" ],
  [ "こ", "ko" ],

  [ "さ", "sa" ],
  [ "し", "shi" ],
  [ "す", "su" ],
  [ "せ", "se" ],
  [ "そ", "so" ],

  [ "た", "ta" ],
  [ "ち", "chi" ],
  [ "つ", "tsu" ],
  [ "て", "te" ],
  [ "と", "to" ],

  [ "な", "na" ],
  [ "に", "ni" ],
  [ "ぬ", "nu" ],
  [ "ね", "ne" ],
  [ "の", "no" ],

  [ "は", "ha" ],
  [ "ひ", "hi" ],
  [ "ふ", "fu" ],
  [ "へ", "he" ],
  [ "ほ", "ho" ],

  [ "ま", "ma" ],
  [ "み", "mi" ],
  [ "む", "mu" ],
  [ "め", "me" ],
  [ "も", "mo" ],

  [ "や", "ya" ],
  [ "ゆ", "yu" ],
  [ "よ", "yo" ],

  [ "ら", "ra" ],
  [ "り", "ri" ],
  [ "る", "ru" ],
  [ "れ", "re" ],
  [ "ろ", "ro" ],

  [ "わ", "wa" ],
  [ "を", "wo" ],

  [ "ん", "n" ],
]

const diacritics = [
  [ "が", "ga"],
  [ "ぎ", "gi"],
  [ "ぐ", "gu"],
  [ "げ", "ge"],
  [ "ご", "go"],
  
  [ "ざ", "za"],
  [ "じ", "ji"],
  [ "ず", 'zu'],
  [ "ぜ", 'ze'],
  [ "ぞ", 'zo'],

  [ "だ", 'da'],
  [ "ぢ", "ji"],
  [ "づ", 'zu'],
  [ "で", 'de'],
  [ "ど", 'do'],

  [ "ば", "ba"],
  [ "び", 'bi'],
  [ "ぶ", 'bu'],
  [ "べ", 'be'],
  [ "ぼ", "bo"],

  [ "ぱ", 'pa'],
  [ "ぴ", 'pi'],
  [ "ぷ", 'pu'],
  [ "ぺ", 'pe'],
  [ "ぽ", 'po'],
]

const monographs_digraphs = [
  ["きゃ", "kya"],
  ["きゅ", "kyu"],
  ["きょ", 'kyo'],

  ["しゃ", 'sha'],
  ["しゅ", "shu"],
  ["しょ", 'sho'],

  ["ちゃ", 'cha'],
  ["ちゅ", 'chu'],
  ["ちょ", 'cho'],

  ["にゃ", 'nya'],
  ["にゅ", 'nyu'],
  ["にょ", 'nyo'],

  ["ひゃ", 'hya'],
  ["ひゅ", 'hyu'],
  ["ひょ", 'hyo'],

  ["みゃ", 'mya'],
  ["みゅ", 'myu'],
  ["みょ", 'myo'],

  ["りゃ", 'rya'],
  ["りゅ", 'ryu'],
  ["りょ", 'ryo'],
]

const diacritics_digraphs = [
  ["ぎゃ", 'gya'],
  ["ぎゅ", 'gyu'],
  ["ぎょ", 'gyo'],

  ["じゃ", 'jya'],
  ["じゅ", 'jyu'],
  ["じょ", 'jyo'],

  ["ぢゃ", 'jya'],
  ["ぢゅ", 'jyu'],
  ["ぢょ", 'jyo'],

  ["びゃ", 'bya'],
  ["びゅ", 'byu'],
  ["びょ", 'byo'],

  ["ぴゃ", "pya"],
  ["ぴゅ", "pyu"],
  ["ぴょ", 'pyo'],
]

const katakana_monographs = [
  [ "ア", "a" ],
  [ "イ", "i" ],
  [ "ウ", "u" ],
  [ "エ", "e" ],
  [ "オ", "o" ],

  [ "カ", "ka" ],
  [ "キ", "ki" ],
  [ "ク", "ku" ],
  [ "ケ", "ke" ],
  [ "コ", "ko" ],

  [ "サ", "sa" ],
  [ "シ", "shi" ],
  [ "ス", "su" ],
  [ "セ", "se" ],
  [ "ソ", "so" ],

  [ "タ", "ta" ],
  [ "チ", "chi" ],
  [ "ツ", "tsu" ],
  [ "テ", "te" ],
  [ "ト", "to" ],

  [ "ナ", "na" ],
  [ "ニ", "ni" ],
  [ "ヌ", "nu" ],
  [ "ネ", "ne" ],
  [ "ノ", "no" ],

  [ "ハ", "ha" ],
  [ "ヒ", "hi" ],
  [ "フ", "fu" ],
  [ "ヘ", "he" ],
  [ "ホ", "ho" ],

  [ "マ", "ma" ],
  [ "ミ", "mi" ],
  [ "ム", "mu" ],
  [ "メ", "me" ],
  [ "モ", "mo" ],

  [ "ヤ", "ya" ],
  [ "ユ", "yu" ],
  [ "ヨ", "yo" ],

  [ "ラ", "ra" ],
  [ "リ", "ri" ],
  [ "ル", "ru" ],
  [ "レ", "re" ],
  [ "ロ", "ro" ],

  [ "ワ", "wa" ],
  [ "ヲ", "wo" ],
  [ "", "" ],
  [ "", "" ],
  [ "", "" ],
  [ "", "" ],
  [ "", "" ],
]

const kanji_l5words = [
  [ '八', 'hachi' ],
  [ '大人', "otona" ],
  [ '一人', 'hitori' ],
  [ '下', 'shita' ],
  [ '人工', 'jinkou' ],
  [ '大きい', 'ookii' ],
  [ '八つ', 'yattsu' ],
  [ '', '' ],
  [ '', '' ],
  [ '', '' ],
  [ '', '' ],
  [ '', '' ],
  [ '', '' ],
  [ '', '' ],
]

const jlpt5words = [
  // nouns
  [ "人", "hito" ],

  // adjectives
  [ "良い", "ii" ],
  [ "良くない", "yokunai" ],
  [ "良かった", "yokatta" ],
  [ "良くなかった", "yokunakatta" ],

  [ "私", "watashi" ],
]

const database = {
  hiragana: {
    monographs: {
      main: monographs,
      digraphs: monographs_digraphs, 
    },
    diacritics: {
      main: diacritics,
      digraphs: diacritics_digraphs,
    },
  },
  words: [ jlpt5words ]
}

export default database;